Revit 2026 API

# SweptBlendTopSketch Property

---

The top profile sketch of the swept blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch TopSketch { get; }
```
```vb
Public ReadOnly Property TopSketch As Sketch
	Get
```
```cpp
public:
property Sketch^ TopSketch {
	Sketch^ get ();
}
```
```fsharp
member TopSketch : Sketch with get
```

#### Property Value

Sketch

If the top profile is based on a family symbol, this property is .

#### Reference

SweptBlend Class

Autodesk.Revit.DB Namespace